c = 2
d = 7
temp = c
c = d
d = temp
print(c,d)


# In[3]:


f = "debargha"
g = "dodo"
tubai = f
f=g
g = tubai
print(f,g)


# In[5]:


de = "debu"
dt = "dodo"
print(de,dt)


# In[6]:


अस्ति = "कश्चित्‍कान्‍ताविरहगुरुणा स्‍वाधिकारात्‍प्रमत:"
कशचिद = "शापेनास्‍तग्‍ड:मितमहिमा वर्षभोग्‍येण भर्तु:।"

संयोगः = अस्ति+कशचिद
print (संयोगः)


# In[7]:


फलं = ['आमः', 'जाम' , 'कन्थल्']
अनुक्रमणिकाकरणम् = फलं.index("जाम")
print(अनुक्रमणिकाकरणम्)


# In[8]:


फलं = ('आमः', 'जाम' , 'कन्थल्')
अंश = slice(2)
print(फलं[अंश])


# In[9]:


फलं = ('आमः', 'जाम' , 'कन्थल्')
अंश = slice(2 , 3)
print(फलं[अंश])


# In[11]:


दैर्घ्य = "यक्षश्‍चक्रे जनकतनयास्‍नानपुण्‍योदकेषु"
print(len(दैर्घ्य))


# In[ ]:




